-- Telescope
require('telescope').setup(require('telescope.themes').get_dropdown())

-- Oasis colorscheme
require('oasis').setup()
vim.cmd.colorscheme('oasis-midnight')

-- Neo-tree
require('neo-tree').setup({})

-- Dashboard
require('dashboard').setup({
  theme = 'doom',
  config = {
    header = {
       '',
       '',
       '      ████ ██████           █████     ██                    ',
       '     ███████████             █████                           ',
       '    █████████ ███████████████████ ███   ███████████ ',
       '   █████████  ███    █████████████ █████ ██████████████ ',
       '   █████████ ██████████ █████████ █████ █████ ████ █████ ',
       ' ███████████ ███    ███ █████████ █████ █████ ████ █████ ',
       ' ██████  █████████████████████ ████ █████ █████ ████ ██████ ',
       '',
       '',
     }, 
    center = {
      { icon = '', desc = 'Find File            ', key = 'f', action = 'Telescope find_files' },
      { icon = '', desc = 'New File              ', key = 'n', action = 'enew' },
      { icon = '', desc = 'Find Text             ', key = 'g', action = 'Telescope live_grep' },
      { icon = '', desc = 'Recent Files          ', key = 'r', action = 'Telescope oldfiles' },
      { icon = '', desc = 'File Explorer         ', key = 'e', action = 'Neotree' },
      { icon = '', desc = 'Quit                  ', key = 'q', action = 'qa' },
    },
    footer = {},
  },
})
